app/views/articles/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 4]]
---
        <li class="article-title"><%= link_to @article.user.username, user_path(@article.user)%></li>
        <li><small> <%= pluralize(@article.user.articles.count, 'article') if @article.user.articles%></small></li>