app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "new article"], ["description", "description"], ["created_at", "2018-03-04 09:42:30.502699"], ["updated_at", "2018-03-04 09:42:30.502699"], ["user_id", 4]]
---
  def create
    @article = Article.new(article_params)
    #@article.user = User.first
    if @article.save