app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "categories"
---
  def index
    @categories = Category.paginate(page: params[:page], per_page: 5)

INSERT INTO "categories" ("name") VALUES (?)  [["name", "sports"]]
---
  def create
    @category = Category.new(category_params)
    if @category.save