app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page], per_page: 5)

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "falguniekbote@gmail.com"], ["updated_at", "2018-03-04 10:47:55.379903"], ["id", 6]]
---
  def update
    if @user.update(user_params)